<a href="https://colab.research.google.com/github/taciomattos/taciomattos/blob/main/Code/Aula_pensamento_computacional.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [54]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('ds_salaries.csv')
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

#1.Quais as dimensões do dataframe? 607 linas e 12 colunas

In [9]:
df.shape

(607, 12)

#Quais são as colunas apresentadas no dataframe?

In [11]:
df.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

#Qual  o  menor  salário  pago,  em  dólares  americanos  (coluna salary_in_usd)?

In [12]:
df['salary_in_usd'].min()

2859

#Qual  o  maior  salário  pago,  em  dólares  americanos  (coluna salary_in_usd)?

In [14]:
df['salary_in_usd'].max()

600000

#5.Quais os cargos descritos (coluna job_title)?

In [30]:
df['job_title'].unique()

array(['Data Scientist', 'Machine Learning Scientist',
       'Big Data Engineer', 'Product Data Analyst',
       'Machine Learning Engineer', 'Data Analyst', 'Lead Data Scientist',
       'Business Data Analyst', 'Lead Data Engineer', 'Lead Data Analyst',
       'Data Engineer', 'Data Science Consultant', 'BI Data Analyst',
       'Director of Data Science', 'Research Scientist',
       'Machine Learning Manager', 'Data Engineering Manager',
       'Machine Learning Infrastructure Engineer', 'ML Engineer',
       'AI Scientist', 'Computer Vision Engineer',
       'Principal Data Scientist', 'Data Science Manager', 'Head of Data',
       '3D Computer Vision Researcher', 'Data Analytics Engineer',
       'Applied Data Scientist', 'Marketing Data Analyst',
       'Cloud Data Engineer', 'Financial Data Analyst',
       'Computer Vision Software Engineer',
       'Director of Data Engineering', 'Data Science Engineer',
       'Principal Data Engineer', 'Machine Learning Developer',
       'Applied Machine Learning Scientist', 'Data Analytics Manager',
       'Head of Data Science', 'Data Specialist', 'Data Architect',
       'Finance Data Analyst', 'Principal Data Analyst',
       'Big Data Architect', 'Staff Data Scientist', 'Analytics Engineer',
       'ETL Developer', 'Head of Machine Learning', 'NLP Engineer',
       'Lead Machine Learning Engineer', 'Data Analytics Lead'],
      dtype=object)

#6.Quantos cargos foram descritos?

In [29]:
len(df['job_title'].unique())

50

#7.Qual a moeda em que mais salários foram pagos (salary_currency)?

In [48]:
salariosemmoedas = df[['salary','salary_currency']].groupby('salary_currency').sum().sort_values(by='salary', ascending = False)
salariosemmoedas

                   salary
salary_currency
INR              55734997
USD              54631386
CLP              30400000
HUF              22000000
JPY              19950000
EUR               5441699
GBP               2712856
CAD               2214500
MXN                778000
CNY                539000
TRY                538000
DKK                480000
PLN                440000
SGD                280000
AUD                241000
BRL                171600
CHF                115000

#8 -Quais as médias e medianas dos salários pagos, em dólar, para cada cargo?

In [56]:
df[['job_title','salary_in_usd']].groupby('job_title').agg([np.mean,np.median])

                                          salary_in_usd
                                                   mean    median
job_title
3D Computer Vision Researcher               5409.000000    5409.0
AI Scientist                               66135.571429   45896.0
Analytics Engineer                        175000.000000  179850.0
Applied Data Scientist                    175655.000000  157000.0
Applied Machine Learning Scientist        142068.750000   56700.0
BI Data Analyst                            74755.166667   76500.0
Big Data Architect                         99703.000000   99703.0
Big Data Engineer                          51974.000000   41305.5
Business Data Analyst                      76691.200000   70912.0
Cloud Data Engineer                       124647.000000  124647.0
Computer Vision Engineer                   44419.333333   26304.5
Computer Vision Software Engineer         105248.666667   95746.0
Data Analyst                               92893.061856   90320.0
Data Analytics Engineer                    64799.250000   64598.5
Data Analytics Lead                       405000.000000  405000.0
Data Analytics Manager                    127134.285714  120000.0
Data Architect                            177873.909091  180000.0
Data Engineer                             112725.000000  105500.0
Data Engineering Manager                  123227.200000  150000.0
Data Science Consultant                    69420.714286   76833.0
Data Science Engineer                      75803.333333   60000.0
Data Science Manager                      158328.500000  155750.0
Data Scientist                            108187.832168  103691.0
Data Specialist                           165000.000000  165000.0
Director of Data Engineering              156738.000000  156738.0
Director of Data Science                  195074.000000  168000.0
ETL Developer                              54957.000000   54957.0
Finance Data Analyst                       61896.000000   61896.0
Financial Data Analyst                    275000.000000  275000.0
Head of Data                              160162.600000  200000.0
Head of Data Science                      146718.750000  138937.5
Head of Machine Learning                   79039.000000   79039.0
Lead Data Analyst                          92203.000000   87000.0
Lead Data Engineer                        139724.500000  121593.5
Lead Data Scientist                       115190.000000  115000.0
Lead Machine Learning Engineer             87932.000000   87932.0
ML Engineer                               117504.000000   70537.5
Machine Learning Developer                 85860.666667   78791.0
Machine Learning Engineer                 104880.146341   87932.0
Machine Learning Infrastructure Engineer  101145.000000   58255.0
Machine Learning Manager                  117104.000000  117104.0
Machine Learning Scientist                158412.500000  156500.0
Marketing Data Analyst                     88654.000000   88654.0
NLP Engineer                               37236.000000   37236.0
Principal Data Analyst                    122500.000000  122500.0
Principal Data Engineer                   328333.333333  200000.0
Principal Data Scientist                  215242.428571  173762.0
Product Data Analyst                       13036.000000   13036.0
Research Scientist                        109019.500000   76263.5
Staff Data Scientist                      105000.000000  105000.0